In [1]:
import pandas as pd

In [2]:
from os import chdir

In [3]:
chdir("C:/Users/Suja4/OneDrive/Documents/Data Science/Dataset")

In [11]:
emp=pd.read_csv("emp_2.csv")
emp

   empid      fn        ln     sal  did
0    101   Naman     Singh    5000   20
1    102   Raman  Tripathi    7000   20
2    103  Chaman     Nagor    8000   20
3    104   Nisha     Patil    9000   30
4    105   Madhu     Reddy   10000   30
5    106   Rahul   Barkade  122746  113

In [12]:
dept=pd.read_csv("dept.csv")

In [14]:
dept

   dept_id dname
0       10    HR
1       20   MKT
2       30   SAL
3       40   ADM
4       50   FIN
5       60   ACC

# Aggregate function

In [16]:
emp.sal.min()

5000

In [18]:
emp.sal.max()

122746

In [22]:
emp.sal.mean()

26957.666666666668

In [25]:
emp.groupby(by=emp["did"])["sal"].max()

did
20       8000
30      10000
113    122746
Name: sal, dtype: int64

In [26]:
emp.groupby(by=emp["did"]).sal.min()

did
20       5000
30       9000
113    122746
Name: sal, dtype: int64

# joins

In [28]:
pd.merge(left=emp,right=dept,left_on="did",right_on="dept_id",how="inner")

   empid      fn        ln    sal  did  dept_id dname
0    101   Naman     Singh   5000   20       20   MKT
1    102   Raman  Tripathi   7000   20       20   MKT
2    103  Chaman     Nagor   8000   20       20   MKT
3    104   Nisha     Patil   9000   30       30   SAL
4    105   Madhu     Reddy  10000   30       30   SAL

In [29]:
pd.merge(left=emp,right=dept,left_on="did",right_on="dept_id",how="right")

   empid      fn        ln      sal   did  dept_id dname
0    NaN     NaN       NaN      NaN   NaN       10    HR
1  101.0   Naman     Singh   5000.0  20.0       20   MKT
2  102.0   Raman  Tripathi   7000.0  20.0       20   MKT
3  103.0  Chaman     Nagor   8000.0  20.0       20   MKT
4  104.0   Nisha     Patil   9000.0  30.0       30   SAL
5  105.0   Madhu     Reddy  10000.0  30.0       30   SAL
6    NaN     NaN       NaN      NaN   NaN       40   ADM
7    NaN     NaN       NaN      NaN   NaN       50   FIN
8    NaN     NaN       NaN      NaN   NaN       60   ACC

In [30]:
pd.merge(left=emp,right=dept,left_on="did",right_on="dept_id",how="outer")

   empid      fn        ln       sal    did  dept_id dname
0  101.0   Naman     Singh    5000.0   20.0     20.0   MKT
1  102.0   Raman  Tripathi    7000.0   20.0     20.0   MKT
2  103.0  Chaman     Nagor    8000.0   20.0     20.0   MKT
3  104.0   Nisha     Patil    9000.0   30.0     30.0   SAL
4  105.0   Madhu     Reddy   10000.0   30.0     30.0   SAL
5  106.0   Rahul   Barkade  122746.0  113.0      NaN   NaN
6    NaN     NaN       NaN       NaN    NaN     10.0    HR
7    NaN     NaN       NaN       NaN    NaN     40.0   ADM
8    NaN     NaN       NaN       NaN    NaN     50.0   FIN
9    NaN     NaN       NaN       NaN    NaN     60.0   ACC